

## Assigning subsets of data


## Assignment

```Python
variable = expression
```
```Python
subset_of_DataFrame_or_Series = new_values
```

## Documentation on Assigning subsets of data
There isn't one particular sub-section of the documentation that covers this topic precisely. Several examples are available throughout the entire [indexing section](http://pandas.pydata.org/pandas-docs/stable/indexing.html).


## Small Sample Dataset
During this tutorial, we will be working with a small sample of the [employee](Dataset%20Descriptions.ipynb#Employee-Data) dataset. The small dataset will help us immediately see the changes.

In [3]:
from google.colab import drive
import os
drive.mount('/content/drive')
os.chdir('drive/My Drive/courses/FML/2. Data Science/1. Data Analysis/2. Pandas')
!ls

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive
'1. pandas_intro.ipynb'
'2. pandas series.ipynb'
'3. Pandas DataFrame.ipynb'
'4. Selecting Subsets with [ ], .loc and .iloc.ipynb'
'5. Boolean Indexing.ipynb'
'6. Assigning subsets of data.ipynb'
'7. Other Important concepts in Pandas.ipynb'
'8. Groupby.ipynb'
'capstone projects'
 data
 images
'pandas from numpy.pptx'
'Pandas Solutions(Part 4-6).ipynb'
'samples codes'

In [0]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv('data/employee_sample.csv', index_col=0)
df

          GENDER   RACE          DEPARTMENT  YEARS EXPERIENCE  SALARY
Tom         Male  White         Engineering                23  107962
Niko        Male  Black         Engineering                 1   30347
Penelope  Female  White         Engineering                12   60258
Aria      Female  Black         Engineering                 8   43618
Sofia     Female  Black  Parks & Recreation                23   26125
Dean        Male  Black  Parks & Recreation                 3   33592
Zach        Male  White  Parks & Recreation                 4   37565

## Creating a new column
Before we change any of the data in this DataFrame, we will add a single column to the end. There are multiple ways of doing so, but we will begin by using [ ] (the brackets). Place a string inside of the brackets and make this the left-hand side of the assignment.

The right-hand side can consist of any of the following:
* A scalar value
* A list or array with the same length as the DataFrame
* A pandas Series with an index that matches the index of the DataFrame (a little tricky!)

## New column assigned to a scalar value
A **scalar** value is simply one single value, like an integer, string, boolean or date. When using a scalar for column assignment, each value in the column will be the same. Let's create a column **`SCORE`** and assign it the value 99.

In [0]:
df['SCORE'] = 99

In [7]:
df

          GENDER   RACE          DEPARTMENT  YEARS EXPERIENCE  SALARY  SCORE
Tom         Male  White         Engineering                23  107962     99
Niko        Male  Black         Engineering                 1   30347     99
Penelope  Female  White         Engineering                12   60258     99
Aria      Female  Black         Engineering                 8   43618     99
Sofia     Female  Black  Parks & Recreation                23   26125     99
Dean        Male  Black  Parks & Recreation                 3   33592     99
Zach        Male  White  Parks & Recreation                 4   37565     99

## Create a new column with a list or array

Instead of creating a new column with all the same values, we can use a list or NumPy array with different values for each row. The only stipulation is that the number of new values in the list/array must be the same as the number of rows in the DataFrame.

Let's create the column **`BONUS RATE`**, with a list of numbers between 0 and 1.

In [8]:
df['BONUS RATE'] = [.2, .1, 0, .15, .12, .3, 0.5]
df

          GENDER   RACE          DEPARTMENT  ...  SALARY  SCORE  BONUS RATE
Tom         Male  White         Engineering  ...  107962     99        0.20
Niko        Male  Black         Engineering  ...   30347     99        0.10
Penelope  Female  White         Engineering  ...   60258     99        0.00
Aria      Female  Black         Engineering  ...   43618     99        0.15
Sofia     Female  Black  Parks & Recreation  ...   26125     99        0.12
Dean        Male  Black  Parks & Recreation  ...   33592     99        0.30
Zach        Male  White  Parks & Recreation  ...   37565     99        0.50

[7 rows x 7 columns]

We could have just as easily used a one dimensional NumPy array to get the same exact results. Let's do just that and create a random array of integers to represent the floor that the employee works on.

We use the **`randint`** function from NumPy's **`rand`** module. Use the **`low`** (inclusive) and **`high`** (exclusive) parameters to bound the range of possible integers. **`len(df)`** returns the number of rows in the DataFrame ensuring that the size of the array is correct..

In [0]:
floor = np.random.randint(low=1, high=10, size=len(df))
floor

array([5, 4, 7, 3, 2, 9, 8])

Then assign this to the **`FLOOR`** column:

In [0]:
df['FLOOR'] = floor
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,SCORE,BONUS RATE,FLOOR
Tom,Male,White,Engineering,23,107962,99,0.20,5
Niko,Male,Black,Engineering,1,30347,99,0.10,4
Penelope,Female,White,Engineering,12,60258,99,0.00,7
Aria,Female,Black,Engineering,8,43618,99,0.15,3
Sofia,Female,Black,Parks & Recreation,23,26125,99,0.12,2
Dean,Male,Black,Parks & Recreation,3,33592,99,0.30,9
Zach,Male,White,Parks & Recreation,4,37565,99,0.50,8

## Creating a new column with a Series (tricky!)
Let's create a new pandas Series and see what happens when we attempt to assign it as a new column in our DataFrame.

Let's try and add a column for the last name of each person.

In [0]:
last_name = pd.Series(['Smith', 'Jones', 'Williams', 'Green', 'Brown'])
last_name

0       Smith
1       Jones
2    Williams
3       Green
4       Brown
dtype: object

In [0]:
df['last name'] = last_name

In [0]:
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,SCORE,last name
Tom,Male,White,Engineering,23,107962,99,NaN
Niko,Male,Black,Engineering,1,30347,99,NaN
Penelope,Female,White,Engineering,12,60258,99,NaN
Aria,Female,Black,Engineering,8,43618,99,NaN
Sofia,Female,Black,Parks & Recreation,23,26125,99,NaN
Dean,Male,Black,Parks & Recreation,3,33592,99,NaN
Zach,Male,White,Parks & Recreation,4,37565,99,NaN

In [0]:
last_name.index

RangeIndex(start=0, stop=5, step=1)

In [0]:
df.index

Index(['Tom', 'Niko', 'Penelope', 'Aria', 'Sofia', 'Dean', 'Zach'], dtype='object')

So, DataFrame(df) & Series(last_name) have different index and that is causing the problem. Lets fix it.

In [0]:
last_name.index = df.index[:len(last_name)]; last_name

Tom            Smith
Niko           Jones
Penelope    Williams
Aria           Green
Sofia          Brown
dtype: object

Make the assignment like we have done above:

In [0]:
df['LAST NAME'] = last_name
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,SCORE,last name,LAST NAME
Tom,Male,White,Engineering,23,107962,99,NaN,Smith
Niko,Male,Black,Engineering,1,30347,99,NaN,Jones
Penelope,Female,White,Engineering,12,60258,99,NaN,Williams
Aria,Female,Black,Engineering,8,43618,99,NaN,Green
Sofia,Female,Black,Parks & Recreation,23,26125,99,NaN,Brown
Dean,Male,Black,Parks & Recreation,3,33592,99,NaN,NaN
Zach,Male,White,Parks & Recreation,4,37565,99,NaN,NaN

## All missing values!
Our attempt failed because pandas uses a completely different methodology for combining two pandas objects. 

## Automatic alignment of the Index
Whenever two pandas objects are combined in some fashion the row/column index of one is aligned with the row/column index of the other. This all happens silently and implicitly behind the scenes. So if you are unaware of it, you will be completely taken by surprise.

Our operation failed to add the last names because the index of our Series is the integers 0 through 6, while the index of the DataFrame are the names of the employees. There are no index values in common between the objects, so pandas defaults to NaN (Not a number).

## Create a Series with same Index as DataFrame
To use a Series to create a new column, the index must match that of the modifying DataFrame. Let's re-create our Series with the same index as the DataFrame.

In [0]:
last_name = pd.Series(data=['Smith', 'Jones', 'Williams', 'Green', 'Brown', 'Simpson', 'Peters'],
                      index=df.index)
last_name

Tom            Smith
Niko           Jones
Penelope    Williams
Aria           Green
Sofia          Brown
Dean         Simpson
Zach          Peters
dtype: object

Let's try that assignment again. This technically will overwrite our previous **`LAST NAME`** column

In [0]:
df['LAST NAME'] = last_name
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,SCORE,last name,LAST NAME,BONUS RATE,FLOOR
Tom,Male,White,Engineering,23,107962,99,NaN,Smith,0.20,7
Niko,Male,Black,Engineering,1,30347,99,NaN,Jones,0.10,5
Penelope,Female,White,Engineering,12,60258,99,NaN,Williams,0.00,7
Aria,Female,Black,Engineering,8,43618,99,NaN,Green,0.15,2
Sofia,Female,Black,Parks & Recreation,23,26125,99,NaN,Brown,0.12,5
Dean,Male,Black,Parks & Recreation,3,33592,99,NaN,Simpson,0.30,9
Zach,Male,White,Parks & Recreation,4,37565,99,NaN,Peters,0.50,3

## Create a new column with expressions involving other columns
We can create a new column by combining any number of other columns. One primary way of doing that is through a mathematical expression. For instance, let's create a new column **`BONUS`** by multiplying the **`BONUS RATE`** and **`SALARY`** columns together.

## Output before assignment
Before adding this new column to your DataFrame, you might want to consider viewing the output before making the assignment. This gives you a little preview so that you can check your work before doing the more permanent assignment.

Let's multiple our two columns without assignment:

In [0]:
df['BONUS RATE'] * df['SALARY']

Tom         21592.4
Niko         3034.7
Penelope        0.0
Aria         6542.7
Sofia        3135.0
Dean        10077.6
Zach        18782.5
dtype: float64

Everything appears to be OK, so go ahead and make the assignment. Notice that the output is a Series with index the same as the DataFrame.

In [0]:
df['BONUS'] = df['BONUS RATE'] * df['SALARY']
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,SCORE,last name,LAST NAME,BONUS RATE,FLOOR,BONUS
Tom,Male,White,Engineering,23,107962,99,NaN,Smith,0.20,7,21592.4
Niko,Male,Black,Engineering,1,30347,99,NaN,Jones,0.10,5,3034.7
Penelope,Female,White,Engineering,12,60258,99,NaN,Williams,0.00,7,0.0
Aria,Female,Black,Engineering,8,43618,99,NaN,Green,0.15,2,6542.7
Sofia,Female,Black,Parks & Recreation,23,26125,99,NaN,Brown,0.12,5,3135.0
Dean,Male,Black,Parks & Recreation,3,33592,99,NaN,Simpson,0.30,9,10077.6
Zach,Male,White,Parks & Recreation,4,37565,99,NaN,Peters,0.50,3,18782.5

# Actual Subset Assignment
So far, we have just added new columns to our DataFrame. We did not change any of the pre-existing values. Let's begin doing this by changing each person's **`SCORE`** to 100.

The syntax is the same, whether it's adding a new column or changing an existing column:

In [0]:
df['SCORE'] = 100
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,SCORE,last name,LAST NAME,BONUS RATE,FLOOR,BONUS
Tom,Male,White,Engineering,23,107962,100,NaN,Smith,0.20,7,21592.4
Niko,Male,Black,Engineering,1,30347,100,NaN,Jones,0.10,5,3034.7
Penelope,Female,White,Engineering,12,60258,100,NaN,Williams,0.00,7,0.0
Aria,Female,Black,Engineering,8,43618,100,NaN,Green,0.15,2,6542.7
Sofia,Female,Black,Parks & Recreation,23,26125,100,NaN,Brown,0.12,5,3135.0
Dean,Male,Black,Parks & Recreation,3,33592,100,NaN,Simpson,0.30,9,10077.6
Zach,Male,White,Parks & Recreation,4,37565,100,NaN,Peters,0.50,3,18782.5

## Overwriting the same column
You can use the column itself you are assigning in the expression on the right-hand side of the equal sign. For instance, if we want to remove the ugly decimals from the **`BONUS`** column, we can call the **`astype`** method on it and assign it to itself.

In [0]:
df['BONUS'] = df['BONUS'].astype(int)
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,SCORE,last name,LAST NAME,BONUS RATE,FLOOR,BONUS
Tom,Male,White,Engineering,23,107962,100,NaN,Smith,0.20,7,21592
Niko,Male,Black,Engineering,1,30347,100,NaN,Jones,0.10,5,3034
Penelope,Female,White,Engineering,12,60258,100,NaN,Williams,0.00,7,0
Aria,Female,Black,Engineering,8,43618,100,NaN,Green,0.15,2,6542
Sofia,Female,Black,Parks & Recreation,23,26125,100,NaN,Brown,0.12,5,3135
Dean,Male,Black,Parks & Recreation,3,33592,100,NaN,Simpson,0.30,9,10077
Zach,Male,White,Parks & Recreation,4,37565,100,NaN,Peters,0.50,3,18782

## Assigning a subset of rows within a single column
Now that we can change all the values in a single at once, let's learn how to change just a subset of them.

For instance, let's change the **`FLOOR`** for **`Niko`**, **`Penelope`**, and **`Aria`**. Before doing so, let's remember how to make that subset selection with **`.loc`**:

In [0]:
df.loc[['Niko', 'Penelope', 'Aria'], ['FLOOR']]

          FLOOR
Niko          5
Penelope      7
Aria          2

The **`.loc`** indexer allows for row and column selection separated by a comma. It only makes selections based on row/column **labels**. Once we have correctly selected our subset, let's assign it a list of three new integers

In [0]:
df.loc[['Niko', 'Penelope', 'Aria'], 'FLOOR'] = [3, 6, 4]
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,SCORE,last name,LAST NAME,BONUS RATE,FLOOR,BONUS
Tom,Male,White,Engineering,23,107962,100,NaN,Smith,0.20,7,21592
Niko,Male,Black,Engineering,1,30347,100,NaN,Jones,0.10,3,3034
Penelope,Female,White,Engineering,12,60258,100,NaN,Williams,0.00,6,0
Aria,Female,Black,Engineering,8,43618,100,NaN,Green,0.15,4,6542
Sofia,Female,Black,Parks & Recreation,23,26125,100,NaN,Brown,0.12,5,3135
Dean,Male,Black,Parks & Recreation,3,33592,100,NaN,Simpson,0.30,9,10077
Zach,Male,White,Parks & Recreation,4,37565,100,NaN,Peters,0.50,3,18782

## Assigning subsets with `.iloc`
Similarly, we can use the **`.iloc`** indexer which only makes selections via **`integer location`**.

Let's assign the 3rd - 6th rows of the **`SCORE`** column (integer location 5) with the value 99.

In [0]:
df.iloc[3:6, 5] = 99

In [0]:
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,SCORE,last name,LAST NAME,BONUS RATE,FLOOR,BONUS
Tom,Male,White,Engineering,23,107962,100,NaN,Smith,0.20,7,21592
Niko,Male,Black,Engineering,1,30347,100,NaN,Jones,0.10,3,3034
Penelope,Female,White,Engineering,12,60258,100,NaN,Williams,0.00,6,0
Aria,Female,Black,Engineering,8,43618,99,NaN,Green,0.15,4,6542
Sofia,Female,Black,Parks & Recreation,23,26125,99,NaN,Brown,0.12,5,3135
Dean,Male,Black,Parks & Recreation,3,33592,99,NaN,Simpson,0.30,9,10077
Zach,Male,White,Parks & Recreation,4,37565,100,NaN,Peters,0.50,3,18782

## Assigning an entire column with `.loc` and `.iloc`
Normally, [ ] is used to change values of an entire column, but it's also possible to do it with both **`.loc`** and **.`iloc`**. You have to remember that the fist selection made by both these indexers is the rows. To select all rows, use the colon **`:`**.

For instance, let's see this in action by changing all values in the **`FLOOR`** column.

In [0]:
df_selected = df[['GENDER', 'YEARS EXPERIENCE', 'SCORE']].copy()

In [0]:
df_selected.loc[df_selected['YEARS EXPERIENCE'] > 20, 'SCORE'] = 100

In [0]:
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,SCORE,last name,LAST NAME
Tom,Male,White,Engineering,23,107962,99,NaN,Smith
Niko,Male,Black,Engineering,1,30347,99,NaN,Jones
Penelope,Female,White,Engineering,12,60258,99,NaN,Williams
Aria,Female,Black,Engineering,8,43618,99,NaN,Green
Sofia,Female,Black,Parks & Recreation,23,26125,99,NaN,Brown
Dean,Male,Black,Parks & Recreation,3,33592,99,NaN,NaN
Zach,Male,White,Parks & Recreation,4,37565,99,NaN,NaN

In [0]:
df_orig = df.copy()
df.loc[:, 'FLOOR'] = 33
df

And with **`.iloc`**:

In [0]:
df_orig = df.copy()
df.iloc[:, 7] = 22
df

## Assigning with boolean selection
It is more common to use boolean selection to make assignments to subsets than with directly selecting subsets by label or integer location.

For instance, let's say we wanted to give everyone in the engineering department a $5,000 bonus on top of what they already have.

Before making the assignment, let's properly select the data with boolean indexing.

In [0]:
df.loc[df['DEPARTMENT'] == 'Engineering', 'BONUS']

Tom         21592
Niko         3034
Penelope        0
Aria         6542
Name: BONUS, dtype: int32

Once we have confirmed that our selection works, we can make an assignment. We can use the **`+=`** operator to shorten the syntax considerably, which will assign the value back to itself.

In [0]:
df_orig = df.copy()

df.loc[df['DEPARTMENT'] == 'Engineering', 'BONUS'] += 5000

## Assigning with multiple condition boolean selection
Let's do an example with multiple boolean conditions. Let's subtract 10 from the **`SCORE`** of all the black females and white males.

In [0]:
# check our logic first
white_male = (df['GENDER'] == 'Male') & (df['RACE'] == 'White')
black_female = (df['GENDER'] == 'Female') & (df['RACE'] == 'Black')
criteria = white_male | black_female
df[criteria]

In [0]:
df_orig = df.copy()
df.loc[criteria, 'SCORE'] -= 10
df

## Assigning subsets of data in a Series
Assigning subsets of pandas Series is a less common operation but happens analogously to a DataFrame.

Let's first select a copy of the **`SALARY`** column from our above DataFrame:

In [0]:
s = df['SALARY'].copy()
s

We didn't have to use the **`copy`** method, but we did so to avoid the **`SettingWithCopy`** warning. This is a common warning when making assignments during subset selection.

## Assigning with `.loc` and `.iloc`
Since Series do not have columns, I don't use *[ ]* with them (unless I am doing boolean selection). It can be used to select rows, but is ambiguous and confusing and therefore I avoid it. All the capability of explicitly selecting particular Series values is provided with **`.loc`** and **`.iloc`**.

Let's change the salary of **`Tom`**, **`Sofia`**, and **`Zach`**.

In [0]:
s.loc[['Tom', 'Sofia', 'Zach']] = [99999, 39999, 49999]
s

## Assigning Series with boolean indexing
We can use boolean indexing to make assignments as well. Using *[ ]* is acceptable here. Let's double all the salaries below 40,000

In [0]:
s_orig = s.copy()
s[s < 40000] *= 2

Both *[ ]* and **`.loc`** work the same when doing boolean indexing on a Series. However, as mentioned in NoteBook 2, **`.iloc`** should almost never be used when doing boolean indexing as it's not implemented fully.

# Summary

* Assignment means using the equal sign to assign a variable on the left-hand side to an expression on the right-hand side
* New columns are created by passing a string to [ ] and setting it equal to either a scalar, a list/array the same length as the DataFrame, or a Series with identical index as the DataFrame
* There is no output when you make an assignment. You must use an extra line to display the DataFrame/Series
* Select a specific subset of rows/columns with **`.loc`** or **`.iloc`** and manually assign them value with a list/array.
* Use the **`style`** attribute to make particular values pop out for visual display
* You can assign entire columns with **`.loc`** or **`.iloc`** by using the colon, **`:`** for rows
* A more common operation is to use boolean indexing to select subsets of data before making an assignment
* Assigning new values to a Series is similar to DataFrames except that we don't use **`.iloc`** for boolean indexing

# Exercises
We will continue to use the employee sample DataFrame for all the exercises in this tutorial

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.read_csv('data/employee_sample.csv', index_col=0)
df

### Exercise 1
<span  style="color:green; font-size:16px"> Create a Series with the index equal to the same values in **`df`** but in a different order. Make the values of the Series integers representing the employee's age ranging somewhere from 20 to 65. Create a new column **`AGE`**. Does the order of the index matter?</span>

In [0]:
#your code here

### Exercise 2
<span  style="color:green; font-size:16px"> Create a new column **`BONUS`** equal to 0 for everyone</span>

In [0]:
#your code here

### Exercise 3
<span  style="color:green; font-size:16px"> Change the **`BONUS`** column so that everyone with more than 10 years of experience get $10,000.</span>

In [0]:
#your code here

### Exercise 4
<span  style="color:green; font-size:16px"> Create a new column **`TOTAL SALARY`** that is 10% higher than the current **`SALARY`** column and add the bonus on top of that as well. Use **`.loc`** on the left-hand side and NOT *[ ]*. Make the data type **`TOTAL SALARY`** an integer.</span>

In [0]:
#your code here

### Exercise 5
<span  style="color:green; font-size:16px"> Set Aria's department to 'Police'.</span>

In [0]:
#your code here

### Exercise 6
<span  style="color:green; font-size:16px"> Give all the white engineers a salary raise of 10,000 and all the black Parks & Recreation employees a decrease in salary by 10,000.</span>

In [0]:
#your code here

### Exercise 7
<span  style="color:green; font-size:16px"> Use **`.iloc`** to change the age of the employees with integer location 3 and 5 to 60 and 65 respectively.</span>

In [0]:
#your code here